In [19]:
%pip install mysql.connector

Requirement already satisfied: mysql.connector in c:\users\mohot\appdata\local\programs\python\python312\lib\site-packages (2.2.9)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import mysql.connector

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [8]:
conn = mysql.connector.connect(
    host="localhost",
    user="root", 
    password="",
    database="world"
)

In [16]:
df = pd.read_sql_query("SELECT * FROM city ", con=conn)

C:\Users\mohot\AppData\Local\Temp\ipykernel_11836\2806536015.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * FROM city ", con=conn)

In [20]:
df

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]

In [ ]:
pd.read_sql_query("SELECT * FROM city WHERE CountryCode LIKE 'AFG' ", con=conn)

C:\Users\mohot\AppData\Local\Temp\ipykernel_11836\1952788333.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM city WHERE CountryCode LIKE 'AFG' ", con=conn)

   ID            Name CountryCode  District  Population
0   1           Kabul         AFG     Kabol     1780000
1   2        Qandahar         AFG  Qandahar      237500
2   3           Herat         AFG     Herat      186800
3   4  Mazar-e-Sharif         AFG     Balkh      127800

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4079 entries, 0 to 4078
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           4079 non-null   int64
 1   Name         4079 non-null   object
 2   CountryCode  4079 non-null   object
 3   District     4079 non-null   object
 4   Population   4079 non-null   int64
dtypes: int64(2), object(3)
memory usage: 159.5+ KB

WORK WITH JSON DATA

In [23]:
data = pd.read_json('train.json')

In [24]:
data

       id      cuisine                                        ingredients
0   10259        greek  [romaine lettuce, black olives, grape tomatoes...
1   25693  southern_us  [plain flour, ground pepper, salt, tomatoes, g...
2   20130     filipino  [eggs, pepper, salt, mayonaise, cooking oil, g...
3   22213       indian                [water, vegetable oil, wheat, salt]
4   13162       indian  [black pepper, shallots, cornflour, cayenne pe...
..    ...          ...                                                ...
86  41596      italian  [chestnuts, granulated sugar, whole milk ricot...
87  33989       indian  [baby spinach leaves, naan, unsalted butter, c...
88  17004       korean                                    [water, barley]
89   4969      spanish  [cooked ham, red bell pepper, seasoning, potat...
90  31831      italian     [salt, starchy potatoes, grated nutmeg, flour]

[91 rows x 3 columns]